from math import *

def area(a,b):
    ''' Функция подсчета площади прямоугольника принимает два числа a,b - стороны
    фигуры и возвращает их произведение (площадь): a*b'''
    return a * b

def perimeter(a,b):
    '''Функция подсчета периметра прямоугольника принимает два числа a,b - стороны
    фигуры и возвращает их сумму умноженную на 2: 2*(a+b) == 2*a + 2*b'''
    return 2*a + 2*b

def diagonal(a,b):
    '''Функция подсчета диагонали прямоугольника принимает два числа a,b - стороны
    фигуры и возвращает результат выполнения теоремы пифагора, где a и b - катеты, а диагональ - гипотенуза'''
    return sqrt(a**2 + b**2)



